package src.main.lecture_4;

public class Exercise4 {
    public static void main(String[] args) {
        /** Задание №1 Создать класс "Сотрудник" с полями: ФИО, должность, email, телефон, зарплата, возраст.
         Конструктор класса должен заполнять эти поля при создании объекта.
         Внутри класса «Сотрудник» написать метод, который выводит информацию об объекте в консоль.**/




        /** Задание №2 Создать массив из 5 сотрудников.
         Пример:
         // вначале объявляем массив объектов
         Person[] persArray = new Person[5];
         // потом для каждой ячейки массива задаем объект
         persArray[0] = new Person("Ivanov Ivan", "Engineer", "ivivan@mailbox.com", "892312312", 30000, 30);
         persArray[1] = new Person(...);
         ...
         persArray[4] = new Person(...);}
         }**/




        /** Задание №3 Создать класс Park с внутренним классом, с помощью объектов
         которого можно хранить информацию об аттракционах, времени их
         работы и стоимости.**/
    }
}