package src.main.lecture_6;


public class Main {
    public static void main(String[] args) {
        System.out.println("Лекция 6 задание 2");


/*         Задание №1 Реализовать сохранение данных в csv файл:
                Подготовка реализации:
                AppData.java   - Класс для хранения данных
                CsvWriter.java - Класс для записи в CSV
                CsvReader.java - Класс для чтения из CSV
                Main.java      - запуск*/


          /*Задание №2 Реализовать загрузку данных из csv файла. Файл читается целиком.
                Структура csv файла:
                - Строка заголовок с набором столбцов
                - Набор строк с целочисленными значениями
                - Разделитель между столбцами - символ точка с запятой (;)
                Пример:
                Value 1 = 100 и 300
                Value 2 = 200 и 400
                Value 3 = 123 и 500
                Для хранения данных использовать класс вида:
                public class AppData {
                 private String[] header;
                 private int[][] data;
                 // ...
                }
                Если выполняется save(AppData data), то старые данные в файле
                полностью перезаписываются. (;)*/
    }
}